app/Http/Controllers/UserController.php

select * from `countries`
---
    public function registerAgent(){
        if(auth()->user()){
            return redirect()->route('dashboard');
        };

        $title = __('app.agent_register');
        $countries = Country::all();

select * from `countries`
---
    public function employerProfile(){
        $title = __('app.employer_profile');
        $user = Auth::user();


        $countries = Country::all();